#+title: Vary Fan Out

* Kendryte K230
#+PLOT: title:"K230 | Varied Fan-out, 256+256 Network, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Input Neuron Fan-out'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:256]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
|---------------+--------------+--------------+--------------+------------------|
| Input Fan-out |         risp |        vrisp |   vrisp-full | vrisp-full/vrisp |
|---------------+--------------+--------------+--------------+------------------|
|             / |            < |            < |            < |                  |
|             1 | 19587.794454 | 24442.766041 | 25402.115488 |        1.0392488 |
|             2 | 15712.029916 | 24603.272235 | 26198.585276 |        1.0648415 |
|             4 | 12119.845884 | 23448.693087 | 25685.019469 |        1.0953710 |
|             8 |  6576.074662 | 20254.190086 | 25273.267202 |        1.2478044 |
|            16 |  3366.304037 | 16371.971185 | 25381.870238 |        1.5503246 |
|            32 |  1628.326896 | 11232.812393 | 20473.217960 |        1.8226262 |
|            64 |   849.972321 |  6726.256818 | 14888.795586 |        2.2135336 |
|           128 |   466.391915 |  3841.670912 |  9865.162953 |        2.5679355 |
|           256 |   229.502553 |  1919.206769 |  4976.961645 |        2.5932389 |
|---------------+--------------+--------------+--------------+------------------|
#+TBLFM: $5=($4/$3)

* MilkV Jupiter
** 16-bit Integer Charges
#+PLOT: title:"MilkV Jupiter | Varied Fan-out, 256+256 Network, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Input Neuron Fan-out'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:256]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
| Input Fan-out |         risp |        vrisp |   vrisp-full | (vrisp - full) / vrisp |
|             1 | 14630.321048 | 20364.317643 | 22159.535359 |              1.0881551 |
|             2 | 12942.370214 | 19938.310866 | 21351.826862 |              1.0708945 |
|             4 |  7166.116309 | 19093.589137 | 20831.380391 |              1.0910144 |
|             8 |  7913.928118 | 17603.526338 | 20688.171331 |              1.1752288 |
|            16 |  4663.939817 | 15240.858914 | 20640.047885 |              1.3542575 |
|            32 |  1926.376213 | 11915.471644 | 17785.745792 |              1.4926598 |
|            64 |   768.132517 |  8137.325505 | 13898.540653 |              1.7079986 |
|           128 |   376.244254 |  5037.055096 |  9679.914275 |              1.9217408 |
|           256 |   185.412968 |  2714.815918 |  5884.042007 |              2.1673816 |
#+TBLFM: $5=($4/$3)
** 16-bit Float Charges
#+PLOT: title:"MilkV Jupiter | Varied Fan-out, 256+256 Network, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Input Neuron Fan-out'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:256]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
| Input Fan-out |         risp |        vrisp |   vrisp-full | (vrisp - full) / vrisp |
|             1 | 14489.855652 | 19244.462406 | 22033.080467 |              1.1449050 |
|             2 | 12921.432522 | 18439.059829 | 21176.390865 |              1.1484529 |
|             4 | 10373.540832 | 17745.599091 | 20496.927511 |              1.1550429 |
|             8 |  7629.854399 | 16461.420193 | 19954.503731 |              1.2121982 |
|            16 |  4256.311685 | 14271.992784 | 19818.462880 |              1.3886262 |
|            32 |  1823.088246 | 11062.668913 | 16607.019787 |              1.5011766 |
|            64 |   763.430576 |  7790.406893 | 12882.182139 |              1.6535955 |
|           128 |   380.618162 |  4615.886682 |  8658.383480 |              1.8757790 |
|           256 |   188.432612 |  2525.924829 |  5330.669420 |              2.1103832 |
#+TBLFM: $5=($4/$3)

* Desktop Intel i5-12400F
** 8-bit Integer Charges
#+PLOT: title:"Desktop | Varied Fan-out, Network 256+256, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Neuron Fan-out'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:256]"
#+PLOT: labels:("x" "risp" "superneuro" "vrisp")
|---------+-----------+-----------+--------------+------------------|
| Fan-out |      risp |     vrisp |   superneuro | vrisp/superneuro |
|---------+-----------+-----------+--------------+------------------|
|       / |         < |         < |            < |                < |
|       1 | 295665.54 | 303269.24 |      1228.92 |                x |
|       2 | 240749.21 | 266375.42 |       245.72 |        1084.0608 |
|       4 | 164956.61 | 265259.02 |        83.76 |        3166.8937 |
|       8 | 132138.79 | 261328.59 |        24.28 |        10763.121 |
|      16 |  95975.73 | 222340.80 |         6.38 |        34849.655 |
|      32 |  62400.54 | 151494.49 |         1.56 |        97111.853 |
|      64 |  35580.73 |  83102.03 | Failed (OOM) |              inf |
|     128 |  17448.80 |  53350.40 | Failed (OOM) |              inf |
|     256 |   8746.69 |  30995.64 | Failed (OOM) |              inf |
|---------+-----------+-----------+--------------+------------------|
#+TBLFM: @4$5=($3/$4)::@5$5=($3/$4)::@6$5=($3/$4)::@7$5=($3/$4)::@8$5=($3/$4)
** 16-bit Integer Charges
| Input Neuron Fan-out |          risp |         vrisp | superneuro |
|                    1 | 246779.527170 | 318562.645344 |    1228.92 |
|                    2 | 233940.017779 | 264508.279109 |     245.72 |
|                    4 | 163281.301025 | 267351.085445 |      83.76 |
|                    8 | 108230.964879 | 257997.936017 |      24.28 |
|                   16 |  84779.530830 | 212165.574014 |       6.38 |
|                   32 |  52457.365276 | 134399.569921 |       1.56 |
|                   64 |  32545.091224 |  77996.427764 |     Failed |
|                  128 |  16338.828081 |  45204.891169 |     Failed |
|                  256 |   8629.974317 |  23654.810087 |     Failed |
** 16-bit Float Charges
| Input Neuron Fan-out |          risp |         vrisp | superneuro |
|                    1 | 235865.745218 | 148714.364320 |    1228.92 |
|                    2 | 241633.442068 | 129325.953132 |     245.72 |
|                    4 | 167582.785896 | 137515.642404 |      83.76 |
|                    8 | 116104.912399 | 138759.765218 |      24.28 |
|                   16 |  85023.168814 | 129745.439448 |       6.38 |
|                   32 |  55889.339109 |  95535.620456 |       1.56 |
|                   64 |  32697.690235 |  64331.849412 |     Failed |
|                  128 |  16983.897567 |  38621.968175 |     Failed |
|                  256 |   8603.734365 |  21928.766595 |     Failed |
